examples/test.yaml
config:
  target: "https://api.zippopotam.us"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "postcodes.csv"
    fields:
      - "postcode"

scenarios:
  - name: "Get Zip Code Info"
    flow:
      - get:
          url: "/us/{{ postcode }}"